{"tweet":"Design is the language of business. https://t.co/hmM0ZsIOEi by @billykiely of @invisionapp Equality \n\nIntimidate no one with your machine of choice.\n\n#martinlutherking 's Day #developers… https://t.co/RNR6RgyDar RT @sauro: OMG IT FINALLY HAPPENED! THE QUICK BROWN FOX JUMPS OVER THE LAZY DOG https://t.co/Kv1RPFQMPj RT @_fionayeung: Want to learn how to get into UX? I've written an article on FAQs with personal tips and tricks! @GoogleDesign https://t.c… RT @lukew: When there's no GUI (icons, labels, etc.) your memory becomes the UI (voice commands, gestures). Played on a unique Crayfish I saw in my kitchen.\n\n#sketch #draw https://t.co/hhzQPWi1Hr @chuqdennis @ChubaEzeks do you have a portfolio of work? Join  dribbble community on Facebook, share your design work and ask for invite @chuqdennis @ChubaEzeks aww. all given away already atm RT @lukew: how did we ever talk? #iphone10th https://t.co/RlORauNQk6 Chick Hatch Dilemma\n\n#draw #sketch https://t.co/i36Vo8auyj Otter Otter Otter \n#draw #sketch https://t.co/owBX5w7KA7 NoTitle\n\n#sketch https://t.co/1y80pYZxLt Freestyle  Friday: Female hostel gate view after night class @AirforceAgbani;\n\nFinal bus stop… https://t.co/vIAMROROVJ Urban transportation\n\n#sketch https://t.co/v5tFS955jx RT @lukew: \"timely, glance-able information is what makes wearable UI work.\"\nhttp://t.co/s77kLR7RCD http://t.co/11N4Ihb7TM Precious moments: A walk in the forest https://t.co/4VKMYt4TRZ RT @MrBankole: Currently beta testing a @theflutterwave virtual MasterCard. My Apple Music is back. DCC bozos can go screw themselves RT @jasonfried: All Basecamp refunds for 2017 come out of my pocket → https://t.co/t4Ny4XQ4du https://t.co/Jso7MHaDdJ RT @aarron: Dear, @SlackHQ. A way to indicate out of office would be nice so we don't have to edit last name in profile (OOO 12/23-1/2). RT @jmspool: Why I can't convince your execs to invest in user experience.\nAnd neither can you.\nhttps://t.co/eHba68Ndhi RT @jmspool: A meeting that ends early is always a gift. @Wakanowdotcom you can handle your arrival and departure dates in a single screen, avoid multiple tap-ins. Just som… https://t.co/VHyNNqkb3i @Wakanowdotcom even this too? I sincerely believe you can do more... This is cluttered, no hierarchy in performing… https://t.co/s5GlC2owuL Hmmm @Wakanowdotcom I simply don't get this your homepage oo.. More than busy, complicated and no action item. You… https://t.co/j52vIH8Jys Otigba junction monument #042 #sketch https://t.co/kDS9mQHqYi "}
